export interface SpecialDua {
    title?: string;
    content: string;
}

export const specialDuas: SpecialDua[] = [
    {
        title: "اللهم إني أشكو إليك ضعف قوتي",
        content: "اللهم إني أشكو إليك ضعف قوتي، وقلة حيلتي، وهواني على الناس. يا أرحم الراحمين، أنت رب المستضعفين، وأنت ربي، إلى من تكلني؟ إلى بعيد يتجهمني؟ أم إلى عدو او قريب ملكته أمري؟ إن لم يكن بك علي غضب فلا أبالي، ولكن عافيتك هي أوسع لي. أعوذ بنور وجهك الذي أشرقت له الظلمات، وصلح عليه أمر الدنيا والآخرة، من أن ينزل بي غضبك، أو يحل علي سخطك، لك العتبى حتى ترضى، ولا حول ولا قوة إلا بك"
    },
    {
        title: "مناجاة عبد الرحمن",
        content: "اللهم إنك تعلم أني لست جاهزاً، ولم أكن يوماً جاهزاً، ولن أكون. اللهم إن عبدك 'عبد الرحمن' يقف بين يديك مجرداً من الحول والقوة، لا يملك من أمره شيئاً.\n\nاللهم إني أداة في يد قدرتك، وسهم في كنانة حكمتك، فارمني حيث شئت، واستعملني فيما أردت. اللهم إن نجيتني من السم سابقاً وأنا لا أدري، فالهم احفظنى عن يمين و عن شمالى و من فوقى و اعوذ بعظمتك ان اغتال من تحتى\n\nاللهم إني توكلت عليك توكل العاجز الذي لا سند له سواك، امضِ بي في طريقك الذي كتبت، لا بقوتي ولا باستعدادي، ولكن بحولك الذي لا يُغلب، وبمشيئتك التي لا تُرد. يا من جعلتني أداة، اللهم اكفني بحلالك عن حرامك وأغنني بفضلك عمن سواك، فما على الأداة إلا الطاعة لا حول ولا قوة إلا بالله العلي العظيم"
    },
    {
        title: "سبحانك ربى",
        content: "اللهم انت الأول والآخر\n\nأولٌ ليس له مبدأ، آخرٌ جلَّ عن منتهى.\n\nظاهرٌ بالدليل، باطنٌ بالحجاب.\n\nيثبته العقل ولا يدركه الحس..\n\nإنما يقع الإشكال في وصف من له أشكال، وإنما تُضرب الأمثال لمن له أمثال، فأما من لم يزل ولا يزال فما للحس معه مجال.\n\nعظمته عظمت عن نيل كف الخيال،\n\nكيف يقال له كيف؟ والكيف في حقه محال.\n\nأنّى تتخيله الأوهام وهي صنعه؟\n\nوكيف تحده العقول وهي فعله؟\n\nوكيف تحويه الأماكن وهي وضعه؟\n\nانقطع سير الفكر، ووقف سلوك الذهن، وبطلت إشارة الوهم، وعجز لطف الوصف، وعشيت عين العقل، وخرس لسان الحس عن بيان عظمته.\n\nيعلم ما كان، وما يكون، وما هو كائن، وما لم يكن لو كان كيف يكون"
    }
];

export const simpleDuas: string[] = [
    "الله اكبر",
    "حسبى الله و نعم الوكيل",
    "و افوض امرى الى الله ان الله بصير بالعباد",
    "«بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ، أَوْ أَزِلَّ أَوْ أُزَلَّ، أَوْ أَظْلِمَ أَوْ أُظْلَمَ، أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ»",
    "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ",
    "رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب",
    "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
    "اللهم ارزقنى الحكمة و البصيرة لأرى الأمور على حقيقتها"
];
